// 1.Определите переменные str, num, flag и txt со значениями «Привет», 123, true, «true».
// При помощи оператора typeof убедитесь, что значения переменных принадлежат типам: string, number и  boolean.


// const str = 'Привіт';
// const num = 123;
// const flag = true;
// const txt = 'true';
//
// console.log(typeof (str));
// console.log(typeof (num));
// console.log(typeof (flag));
// console.log(typeof (txt));

// 2. Создайте переменные a1, a2, a3, a4, a5. При помощи математических операторов (сложение, вычитание и т.д.) найдите значения выражений:
//     5 + 3,
//     5 - 3,
//     5 * 3,
//     5 / 3,
//     5 % 3
// поместив результат каждого выражения в соответствующую переменную. Например, let a1 = 5 + 3.

// let a1 = 5 + 3;
// let a2 = 5 - 3;
// let a3 = 5 * 3;
// let a4 = 5 / 3;
//
// console.log(a1);
// console.log(a2);
// console.log(a3);
// console.log(a4);

// 3.  Создайте переменные a6, a7, a8, a9, a10. Поместите в них результат выражений:
//     5 % 3,
//     3 % 5,
//     5 + '3',
//     '5' - 3,
//     75 + 'кг'
//
// let a6 = 5 % 3;
// let a7 = 3 % 5;
// let a8 = 5 + '3';
// let a9 = '5' - 3;
// let a10 = 75 + 'кг';
//
// console.log(a6);
// console.log(a7);
// console.log(a8);
// console.log(a9);
// console.log(a10);

//4. Напишите скрипт, который находит площадь прямоугольника высота 23см. (в числовую переменную height), шириной 10см
// (в числовую переменную width), значение площади должно хранится в числовой переменной s.
//
// let height = 23;
// let width = 10;
// let s = (height * width)
// console.log(s);

// 5.  Напиши код, который находит объем цилиндра высотой 10м (переменная heightC) и диаметром основания 4м (dC),
//     результат поместите в переменную v.

// let height1 = 10;
// let dC = 4;
// const pi = 3.14;
// let v = pi * Math.pow(dC / 2, 2) * height1;
// console.log(v);
